applications/test/dbsReactiveThermalFoam/SegregatedSteps/timeStepSensitivityAnalysis/time6e-3/maxDeltaT1e-3/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    // "rho.*"
    // {
    //     solver          diagonal;
    // }

    // p_rgh
    // {
    //     solver          PCG;
    //     preconditioner  DIC;
    //     tolerance       1e-6;
    //     relTol          0.01;
    // }

    // p_rghFinal
    // {
    //     $p_rgh;
    //     tolerance       1e-8;
    //     relTol          0;
    // }


    "(h|e)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-6;
        relTol          0.01;
    }

    "(h|e)Final"
    {
        $h;
        tolerance       1e-8;
        relTol          0;
    }

    "(U|Y.*|O2|CO2)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-6;
        relTol          0.01;
        // relTol          0;
    }

    "(U||Y.*|O2|CO2)Final"
    {
        $U;
        tolerance       1e-8;
        relTol          0;
    }

}


PIMPLE
{
    momentumPredictor no;
    nNonOrthogonalCorrectors 0;
    nCorrectors       1;
    nOuterCorrectors  10;

    outerCorrectorResidualControl
    {
        "(h|e)"    
        {
            tolerance  1e-6;
            relTol     0;
        }

        "(Y.*|O2|CO2)"    
        {
            tolerance  1e-6;
            relTol     0;
        }
        
    }

}


// relaxationFactors
// {
//     equations
//     {
//         "Y"            0.9;
//         "(h|e)"            0.9;
//     }
//     equations
//     {
//         "Y.*Final"            1.0;
//         "(h|e)Final"            1.0;
//     }
// }

//     // fields
//     // {
//     //     p_rgh           0.7;
//     // }
// }



// ************************************************************************* //
